In [1]:
import pandas as pd

In [2]:
purchase_data_df = pd.read_csv("Resources/purchase_data.csv")

In [3]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [81]:
Num_players = purchase_data_df["SN"].nunique()
pd.DataFrame(data=[Num_players], columns=["Total Players"])

   Total Players
0            576

## Purchasing Analysis (Total)
- number of unique items
- average price
- number of purchases
- total revenue

In [82]:
unique_items = purchase_data_df["Item Name"].nunique()
Average = (purchase_data_df["Price"]).mean()
Num_purchase = purchase_data_df["Purchase ID"].value_counts()
Total_num = Num_purchase.sum()
Total_revenue = purchase_data_df["Price"].sum()

pd.DataFrame(data=[[unique_items, Average, Total_num, Total_revenue]],
             columns=["Number of Unique Items", "Average Price", "Number of Purchases", "Total Revenue"])

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

## Gender Demographics
- Percentage and Count of Male Players
- Percentage and Count of Female Players
- Percentage and Count of Other/Non-Disclosed

In [12]:
gender_count = purchase_data_df.groupby("Gender")[["SN"]].nunique()
gender_count

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [13]:
gender_count["SN"]/Num_players

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [14]:
gender_count["Percentage of Players"] = gender_count["SN"]/Num_players

In [15]:
gender_count

                        SN  Percentage of Players
Gender
Female                  81               0.140625
Male                   484               0.840278
Other / Non-Disclosed   11               0.019097

In [16]:
gender_count.rename(columns={'SN':"Total Count"}, inplace=True)

In [17]:
gender_count

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [18]:
gender_count.index.name = None

In [19]:
gender_count

                       Total Count  Percentage of Players
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

## Purchasing Analysis (Gender)
- Purchase Count
- Average Purchase Price
- Total Purchase Value
- Avg Total Purchase per Person

In [20]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
purchase_count = purchase_data_df.groupby("Gender")[["Purchase ID"]].nunique()
purchase_count

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [22]:
purchase_count.rename(columns= {'Purchase ID': "Purchase Count"}, inplace=True)

In [23]:
purchase_count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

### Average Purchase Price

In [24]:
Average_purchase_price = purchase_data_df.groupby("Gender")[["Price"]].mean()
Average_purchase_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [25]:
Average_purchase_price.rename(columns= {'Price': "Average Purchase Price"}, inplace=True)

In [26]:
Average_purchase_price

                       Average Purchase Price
Gender
Female                               3.203009
Male                                 3.017853
Other / Non-Disclosed                3.346000

### Total Purchase Value

In [27]:
Total_purchase_value = purchase_data_df.groupby("Gender")[["Price"]].sum()
Total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [28]:
Total_purchase_value.rename(columns= {'Price': "Total Purchase Value"}, inplace=True)

In [29]:
Total_purchase_value

                       Total Purchase Value
Gender
Female                               361.94
Male                                1967.64
Other / Non-Disclosed                 50.19

### Avg Total Purchase per Person

In [30]:
Avg_Total = Total_purchase_value["Total Purchase Value"]/gender_count["Total Count"]
Avg_Total

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [31]:
Avg_Total = Avg_Total.to_frame()

In [32]:
Avg_Total

                              0
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [33]:
Avg_Total.rename(columns= {0: "Avg Total Purchase per Person"}, inplace=True)

In [34]:
Avg_Total

                       Avg Total Purchase per Person
Gender
Female                                      4.468395
Male                                        4.065372
Other / Non-Disclosed                       4.562727

In [35]:
pd.concat([purchase_count, Average_purchase_price, Total_purchase_value, Avg_Total], axis=1)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics
- Total Count
- Percentage of Players

In [36]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [37]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 75]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [38]:
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names, include_lowest=True)

In [39]:
total_count = purchase_data_df.groupby('Age Ranges')[["SN"]].nunique()

In [40]:
total_count

             SN
Age Ranges
<10          17
10-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40+          12

In [41]:
total_count["SN"]/Num_players

Age Ranges
<10      0.029514
10-14    0.038194
15-19    0.185764
20-24    0.447917
25-29    0.133681
30-34    0.090278
35-39    0.053819
40+      0.020833
Name: SN, dtype: float64

In [42]:
total_count["Percentage of Players"] = total_count["SN"]/Num_players

In [43]:
total_count

             SN  Percentage of Players
Age Ranges
<10          17               0.029514
10-14        22               0.038194
15-19       107               0.185764
20-24       258               0.447917
25-29        77               0.133681
30-34        52               0.090278
35-39        31               0.053819
40+          12               0.020833

In [44]:
total_count.index.name = None

In [45]:
total_count

        SN  Percentage of Players
<10     17               0.029514
10-14   22               0.038194
15-19  107               0.185764
20-24  258               0.447917
25-29   77               0.133681
30-34   52               0.090278
35-39   31               0.053819
40+     12               0.020833

In [46]:
total_count.rename(columns= {'SN': "Total Count"}, inplace=True)

In [47]:
total_count

       Total Count  Percentage of Players
<10             17               0.029514
10-14           22               0.038194
15-19          107               0.185764
20-24          258               0.447917
25-29           77               0.133681
30-34           52               0.090278
35-39           31               0.053819
40+             12               0.020833

## Purchasing Analysis (Age)
- Purchase Count
- Average Purchase Price
- Total Purchase Value
- Avg Total Purchase per Person

In [48]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [49]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 75]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [50]:
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names, include_lowest=True)

In [51]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [52]:
Purchase_Count = purchase_data_df.groupby("Age Ranges")[["Purchase ID"]].count()

In [53]:
Purchase_Count

            Purchase ID
Age Ranges
<10                  23
10-14                28
15-19               136
20-24               365
25-29               101
30-34                73
35-39                41
40+                  13

In [54]:
Purchase_Count.rename(columns= {"Purchase ID": "Purchase Count"}, inplace=True)

In [55]:
Purchase_Count

            Purchase Count
Age Ranges
<10                     23
10-14                   28
15-19                  136
20-24                  365
25-29                  101
30-34                   73
35-39                   41
40+                     13

In [56]:
Purchase_Count.sort_values('Purchase Count', ascending=False)

            Purchase Count
Age Ranges
20-24                  365
15-19                  136
25-29                  101
30-34                   73
35-39                   41
10-14                   28
<10                     23
40+                     13

In [57]:
Average_Purchase_Price = purchase_data_df.groupby("Age Ranges")[["Price"]].mean()
Average_Purchase_Price

               Price
Age Ranges
<10         3.353478
10-14       2.956429
15-19       3.035956
20-24       3.052219
25-29       2.900990
30-34       2.931507
35-39       3.601707
40+         2.941538

In [58]:
Average_Purchase_Price.rename(columns= {'Price': "Average Purchase Price"}, inplace=True)

In [59]:
Average_Purchase_Price

            Average Purchase Price
Age Ranges
<10                       3.353478
10-14                     2.956429
15-19                     3.035956
20-24                     3.052219
25-29                     2.900990
30-34                     2.931507
35-39                     3.601707
40+                       2.941538

In [68]:

Total_Purchase_Value = purchase_data_df.groupby("Age Ranges")[["Price"]].sum()
Total_Purchase_Value

              Price
Age Ranges
<10           77.13
10-14         82.78
15-19        412.89
20-24       1114.06
25-29        293.00
30-34        214.00
35-39        147.67
40+           38.24

In [69]:
Total_Purchase_Value.rename(columns= {'Price': "Total Purchase Value"}, inplace=True)

In [70]:
Total_Purchase_Value

            Total Purchase Value
Age Ranges
<10                        77.13
10-14                      82.78
15-19                     412.89
20-24                    1114.06
25-29                     293.00
30-34                     214.00
35-39                     147.67
40+                        38.24

In [71]:
Total_per_person = Total_Purchase_Value["Total Purchase Value"]/total_count["Total Count"]

In [72]:
Total_per_person = Total_per_person.to_frame()

In [74]:
Total_per_person

                   0
Age Ranges
<10         4.537059
10-14       3.762727
15-19       3.858785
20-24       4.318062
25-29       3.805195
30-34       4.115385
35-39       4.763548
40+         3.186667

In [75]:
Total_per_person.rename(columns= {0: "Avg Total Purchase per Person"}, inplace=True)

In [76]:
Total_per_person

            Avg Total Purchase per Person
Age Ranges
<10                              4.537059
10-14                            3.762727
15-19                            3.858785
20-24                            4.318062
25-29                            3.805195
30-34                            4.115385
35-39                            4.763548
40+                              3.186667

In [78]:
pd.concat([Purchase_Count, Average_Purchase_Price, Total_Purchase_Value, Total_per_person], axis=1)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Top Spenders
- Purchase Count
- Average Purchase Price
- Total Purchase Value

In [84]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [97]:
purchase_count = purchase_data_df.groupby("SN")[["Item ID"]].count()

In [98]:
purchase_count

               Item ID
SN
Adairialis76         1
Adastirin33          1
Aeda94               1
Aela59               1
Aelaria33            1
...                ...
Yathecal82           3
Yathedeu43           2
Yoishirrala98        1
Zhisrisu83           2
Zontibe81            3

[576 rows x 1 columns]

In [102]:
purchase_count.rename(columns={'Item ID': "Purchase Count"}, inplace=True)

In [103]:
purchase_count

               Purchase Count
SN
Adairialis76                1
Adastirin33                 1
Aeda94                      1
Aela59                      1
Aelaria33                   1
...                       ...
Yathecal82                  3
Yathedeu43                  2
Yoishirrala98               1
Zhisrisu83                  2
Zontibe81                   3

[576 rows x 1 columns]

In [128]:
##purchase_count.sort_values('Purchase Count', ascending=False)

In [130]:
avg_purchase_count = purchase_data_df.groupby("SN")["Price"].mean()
avg_purchase_count

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [131]:
avg_purchase_count = avg_purchase_count.to_frame()

In [132]:
avg_purchase_count

                  Price
SN
Adairialis76   2.280000
Adastirin33    4.480000
Aeda94         4.910000
Aela59         4.320000
Aelaria33      1.790000
...                 ...
Yathecal82     2.073333
Yathedeu43     3.010000
Yoishirrala98  4.580000
Zhisrisu83     3.945000
Zontibe81      2.676667

[576 rows x 1 columns]

In [144]:
avg_purchase_count.rename(columns={'Price':"Average Purchase Price"}, inplace=True)

In [145]:
avg_purchase_count

               Average Purchase Price
SN
Adairialis76                 2.280000
Adastirin33                  4.480000
Aeda94                       4.910000
Aela59                       4.320000
Aelaria33                    1.790000
...                               ...
Yathecal82                   2.073333
Yathedeu43                   3.010000
Yoishirrala98                4.580000
Zhisrisu83                   3.945000
Zontibe81                    2.676667

[576 rows x 1 columns]

In [129]:
##avg_purchase_count.sort_values('Average Purchase Price', ascending=False)

In [133]:
tol_purchase_value = purchase_data_df.groupby("SN")["Price"].sum()

In [134]:
tol_purchase_value

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [135]:
tol_purchase_value = tol_purchase_value.to_frame()

In [140]:
tol_purchase_value

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [141]:
tol_purchase_value.rename(columns={"Price": "Total Purchase Value"}, inplace=True)

In [142]:
tol_purchase_value

               Total Purchase Value
SN
Adairialis76                   2.28
Adastirin33                    4.48
Aeda94                         4.91
Aela59                         4.32
Aelaria33                      1.79
...                             ...
Yathecal82                     6.22
Yathedeu43                     6.02
Yoishirrala98                  4.58
Zhisrisu83                     7.89
Zontibe81                      8.03

[576 rows x 1 columns]

In [138]:
##tol_purchase_value.sort_values('Total Purchase Value', ascending=False)

In [146]:
pd.concat([purchase_count, avg_purchase_count, tol_purchase_value], axis=1)

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [120]:
##purchase_data_df.sort_values('Item Name', ascending=False)

In [121]:
##Purchase_Count = purchase_data_df.groupby("SN")[["Purchase ID"]].count()
##Purchase_Count

In [83]:
##temp = df.groupby(["Item ID", "Item Name"])[["Purchase ID"]].count()
### Rename column to Purchase Count ###
##temp.sort_values("Purchase Count", ascending=False)

## Most Popular Items
- Purchase Count
- Item Price
- Total Purchase Value

In [147]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [151]:
Purchase_Ct = purchase_data_df.groupby(["Item ID", "Item Name"])[["Purchase ID"]].count()

In [152]:
Purchase_Ct

                                                      Purchase ID
Item ID Item Name
0       Splinter                                                4
1       Crucifer                                                4
2       Verdict                                                 6
3       Phantomlight                                            6
4       Bloodlord's Fetish                                      5
...                                                           ...
178     Oathbreaker, Last Hope of the Breaking Storm           12
179     Wolf, Promise of the Moonwalker                         6
181     Reaper's Toll                                           5
182     Toothpick                                               3
183     Dragon's Greatsword                                     3

[179 rows x 1 columns]

In [153]:
Purchase_Ct.rename(columns={"Purchase ID": "Purchase Count"}, inplace=True)

In [154]:
Purchase_Ct

                                                      Purchase Count
Item ID Item Name
0       Splinter                                                   4
1       Crucifer                                                   4
2       Verdict                                                    6
3       Phantomlight                                               6
4       Bloodlord's Fetish                                         5
...                                                              ...
178     Oathbreaker, Last Hope of the Breaking Storm              12
179     Wolf, Promise of the Moonwalker                            6
181     Reaper's Toll                                              5
182     Toothpick                                                  3
183     Dragon's Greatsword                                        3

[179 rows x 1 columns]

In [158]:
purchase_data_df.groupby(["Item ID", "Item Name"])[["Price"]].count()

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

## Most Profitable Items
- Purchase Count
- Item Price
- Total Purchase Value